In [1]:
from sqlalchemy import create_engine
from pathlib import Path

import pandas as pd
import numpy as np

pd.options.display.float_format = '{:,.2f}'.format

db_file = 'comisiones.db'
db_file_path_str = str(Path().cwd().parent.parent.joinpath(f'data/{db_file}'))

engine = create_engine(f'sqlite:///{db_file_path_str}')

In [2]:
with engine.connect() as conn, conn.begin():  
    ventas_enero = pd.read_sql_table('ventas_enero', conn, dtype_backend='numpy_nullable')
    ventas_febrero = pd.read_sql_table('ventas_febrero', conn, dtype_backend='numpy_nullable')
    ventas_marzo = pd.read_sql_table('ventas_marzo', conn, dtype_backend='numpy_nullable')
    ventas_abril = pd.read_sql_table('ventas_abril', conn, dtype_backend='numpy_nullable')
    ventas_mayo = pd.read_sql_table('ventas_mayo', conn, dtype_backend='numpy_nullable')
    ventas_junio = pd.read_sql_table('ventas_junio', conn, dtype_backend='numpy_nullable')
    # ventas_julio = pd.read_sql_table('ventas_julio', conn, dtype_backend='numpy_nullable')
    ventas_año = pd.read_sql_table('ventas_año', conn, dtype_backend='numpy_nullable')

engine.dispose()

In [14]:
ventas[['name', 'quantity', 'price_subtotal']].groupby('name', dropna=False).sum()

                   quantity  price_subtotal
name
F1-CC/2024/00001      20.00          129.40
F1-CC/2024/00002       7.00          390.02
F1-CC/2024/00003      40.00          299.00
F1-CC/2024/00004      12.00          126.44
F1-CC/2024/00008       5.00          573.85
...                     ...             ...
RF2-VS/2024/00001     -3.00          -50.52
RF2-VS/2024/00002    -10.00       -4,538.80
RF2-VS/2024/00003    -10.00       -4,285.00
RF2-VS/2024/00004     -1.00         -157.50
RF2-VS/2024/00005     -1.00          -17.07

[24035 rows x 2 columns]

## Algo de <span style="color: steelblue">BI</span>

In [15]:
ventas[['business_model', 'quantity', 'price_subtotal']].groupby('business_model', dropna=False).sum()

                 quantity  price_subtotal
business_model
CE             353,635.94   19,676,765.13
Piso           719,827.74   16,724,691.12
<NA>             4,080.17        4,080.17

In [16]:
ventas[['sale_team_description', 'quantity', 'price_subtotal']].groupby('sale_team_description', dropna=False).sum()

                        quantity  price_subtotal
sale_team_description
A1 CE                 207,085.17   11,702,190.98
A1 Piso               315,692.37    7,070,315.87
A2 CE                 146,550.77    7,974,574.15
A2 Piso               404,135.37    9,654,375.25
<NA>                    4,080.17        4,080.17

In [17]:
ventas[['warehouse', 'quantity', 'price_subtotal']].groupby('warehouse', dropna=False).sum()

            quantity  price_subtotal
warehouse
A1        522,777.54   18,772,506.85
A2        550,686.14   17,628,949.40
<NA>        4,080.17        4,080.17

In [18]:
pd.DataFrame(
    [
        ('Enero', ventas_enero['price_subtotal'].sum()),
        ('Febrero', ventas_febrero['price_subtotal'].sum()),
        ('Marzo', ventas_marzo['price_subtotal'].sum()),
        ('Abril', ventas_abril['price_subtotal'].sum()),
        ('Mayo', ventas_mayo['price_subtotal'].sum()),
        ('Junio', ventas_junio['price_subtotal'].sum()),
        # ('Julio', ventas_julio['price_subtotal'].sum()),
        ('Total del año', ventas_año['price_subtotal'].sum())
    ]
    , columns=['Mes', 'Venta']
)

             Mes         Venta
0          Enero  6,052,588.54
1        Febrero  5,824,480.79
2          Marzo  7,041,388.79
3          Abril  6,732,587.22
4           Mayo  6,665,289.47
5          Junio  4,089,201.61
6  Total del año 36,405,536.42